Reports/Трофеи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Трофеи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КомандаИлиИгрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чемпионат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабито</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропущено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Трофеи/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Если НЕ ПроверитьЗаполнение() Тогда Возврат; КонецЕсли;
	Элементы.ДанныеКоманда.Видимость = (ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки"));
	
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
КонецПроцедуры

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		//
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ссылка") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомандаИлиИгрок);
		Отчет.КомандаИлиИгрок	= Параметры.Ссылка;
	Иначе
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаКлиенте
Процедура КомандаИлиИгрокПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СформироватьНаСервере();
	Иначе
		Отчет.Данные.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаИлиИгрокОчисткаНаСервере(КомандаИлиИгрок)
	Если ТипЗнч(КомандаИлиИгрок) = Тип("СправочникСсылка.Команды") Тогда
		КомандаИлиИгрок = Справочники.Игроки.ПустаяСсылка();
	Иначе
		КомандаИлиИгрок = МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаИлиИгрокОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СтандартнаяОбработка = Ложь;
		КомандаИлиИгрокОчисткаНаСервере(Отчет.КомандаИлиИгрок);
		Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
			СформироватьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(Элемент.ТекущиеДанные.Чемпионат, СтандартнаяОбработка);
КонецПроцедуры
